tap "daveshanley/vacuum" # OpenAPI/Swagger file linter
tap "mike-engel/jwt-cli" # util for reading JWTs
brew "bat" # improved `cat` command
brew "eza" # improved `ls` command
brew "zoxide" # improved `cd` and shell directory traversal
brew "broot" # tree based file explorer
brew "ranger" # table/column based file explorer
brew "fd" # alternative `find` command
brew "fzf" # fuzzy file finder
brew "pv" # a command pipeline progress monitor
brew "stow" # util for expanding dotfiles
brew "gnupg" # open source GPG utils
brew "goaccess" # weblog analyzer utility
brew "htop" # process and system resource explorer
brew "jq" # util for working with JSON
brew "jr" # util for producing random data
brew "pandoc" # util for markup conversion
brew "nvm" # node version manager
brew "pyenv" # python version manager
brew "rename" # util for renaming files in bulk
brew "ripgrep" # very fast file search
brew "tmux" # terminal multi-plexer
brew "aspell"
brew "awscli"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "go"
brew "luarocks"
brew "neovim"
brew "rustup"
cask "font-hack-nerd-font"
